export const notificationText = {
    signUp: {
        Success: () => "Вы успешно записались на курс",
        Fail: () => "Не удалось записаться на курс",
    },
    changeStudentStatus: {
        Success: () => "Вы успешно изменили статус студента",
        Fail: () => "Не удалось измениить статус студента",
    },
    login: {
        Success: () => "Вы успешно вошли в систему",
        Fail: () => "Неверный логин или пароль",
    },
    fetchUsers: {
        Fail: () => "Не удалось загрузить пользователей"
    },
    addTeacher: {
        Success: () => "Преподаватель успешно добавлен",
        Fail: () => "Не удалось добавить преподаваетля"
    },
    editCourseStatus: {
        Success: () => "Статус курса успешно изменен",
        Fail: () => "Не удалось изменить статус курса"
    },
    createCourse: {
        Success: () => "Курс успешно создан",
        Fail: () => "Не удалось создать курс"
    },
    createGroup: {
        Success: () => "Группа успешно создана",
        Fail: () => "Не удалось создать группу"
    },
    createNotification: {
        Success: () => "Уведомление успешно создано",
        Fail: () => "Не удалось создать уведомление"
    },
    deleteGroup: {
        Success: () => "Группа успешно удалена",
        Fail: () => "Не удалось удалить группу"
    },
    editCourse: {
        Success: () => "Данные курса успешно изменены",
        Fail: () => "Не удалось изменить данные курса"
    },
    editGroup: {
        Success: () => "Название группы успешно изменено",
        Fail: () => "Не удалось изменить название группы"
    },
    editStudentMark: {
        Success: () => "Оценка студента успешна изменена",
        Fail: () => "Не удалось изменить оценку студента"
    },
    editRequirementsAndAnnotations: {
        Success: () => "Требования и аннотации успешно изменены",
        Fail: () => 'Не удалось изменить требования и аннотации'
    },
    fetchUserProfile: {
        Fail: () => "Не удалось получить профиль пользователя"
    },
    editUserProfile: {
        Success: () => "Данные пользователя успешно изменены",
        Fail: () => "Не удалось изменить данные пользователя"
    },
    registration: {
        Success: () => "Вы успешно зарегестрировались в системе",
        Fail: () => "Не удалось зарегестрироваться в системе"
    },
    pageLoading: {
        Fail: () => "Не удалось загрузить данные на странице"
    }
}